/*****************************************************************
*Modules: kernel.c
*Dedcription: 存放一些系统的杂项函数，比如：delay、printf、、、等等
*
*Log: <editor>          <date>          <log>
*       zhangq          2016-2-22       添加文件
******************************************************************/
#include "kernel.h"






/*****************************************************************
*Function: 
*Para: 
*Return:
*Dedcription: 
*
*Log: <editor>          <date>          <log>
*       zhangq          2016-2-22       添加函数
******************************************************************/
void DelayMs(void)
{
  
}
/*****************************************************************
*Function: 
*Para: 
*Return:
*Dedcription: 
*
*Log: <editor>          <date>          <log>
*       zhangq          2016-2-22       添加函数
******************************************************************/
void DelayUs(void)
{
  
}
/*****************************************************************
*Function: 
*Para: 
*Return:
*Dedcription: 
*
*Log: <editor>          <date>          <log>
*       zhangq          2016-2-22       添加函数
******************************************************************/
void DelayS(void)
{
  
}

